In [1]:
import pandas as pd
import seaborn as sns
import numpy as np

In [2]:
df = pd.DataFrame([])

In [3]:
df

Empty DataFrame
Columns: []
Index: []

In [4]:
df.dropna?

In [5]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [6]:
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [7]:
#결측치는 사용하는 경우 채울 값을 정의하거나
#결측치가 있는 경우 사용하지 않는다
#axis = 1 열 0은 행
# any 하나라도 null값이 있으면 삭제
# all
df.dropna(axis=1,how='any')

       name
0    Alfred
1    Batman
2  Catwoman

In [8]:
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [9]:
df.dropna(axis=1,how='all')

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [10]:
df.dropna(axis=0,how='any')

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [11]:
df.dropna(axis=0,how='all')

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [16]:
df.fillna?

In [18]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
...                    [3, 4, np.nan, 1],
...                    [np.nan, np.nan, np.nan, 5],
...                    [np.nan, 3, np.nan, 4]],
...                    columns=list('ABCD'))
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

In [19]:
df.fillna(0)

     A    B    C  D
0  0.0  2.0  0.0  0
1  3.0  4.0  0.0  1
2  0.0  0.0  0.0  5
3  0.0  3.0  0.0  4

In [20]:
values = {'A':0,'B':1,'C':2,'D':3}
df.fillna(value=values)

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  0.0  1.0  2.0  5
3  0.0  3.0  2.0  4

In [21]:
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

In [22]:
df.fillna(df['D'].mean())

     A    B    C  D
0  2.5  2.0  2.5  0
1  3.0  4.0  2.5  1
2  2.5  2.5  2.5  5
3  2.5  3.0  2.5  4

In [23]:
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

In [24]:
fill_na_value = df['D'].mean()

In [25]:
fill_na_value

2.5

In [26]:
df.fillna(fill_na_value)

     A    B    C  D
0  2.5  2.0  2.5  0
1  3.0  4.0  2.5  1
2  2.5  2.5  2.5  5
3  2.5  3.0  2.5  4

In [27]:
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

In [28]:
df.isnull().sum()

A    3
B    1
C    4
D    0
dtype: int64

In [29]:
df.notnull().sum()

A    1
B    3
C    0
D    4
dtype: int64